
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: GameplayCameras

#pragma pack(push, 0x1)

/// Class /Game/audio/misc/shake_mortarFire.shake_mortarFire_C
/// Size: 0x01B0 (432 bytes) (0x0001B0 - 0x0001B0) align 16 MaxSize: 0x01B0
class Ushake_mortarFire_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/audio/misc/shake_lakeEntityAttack.shake_lakeEntityAttack_C
/// Size: 0x01B0 (432 bytes) (0x0001B0 - 0x0001B0) align 16 MaxSize: 0x01B0
class Ushake_lakeEntityAttack_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/audio/misc/shake_callShake.shake_callShake_C
/// Size: 0x01B0 (432 bytes) (0x0001B0 - 0x0001B0) align 16 MaxSize: 0x01B0
class Ushake_callShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/audio/misc/shake_gravGun.shake_gravGun_C
/// Size: 0x01B0 (432 bytes) (0x0001B0 - 0x0001B0) align 16 MaxSize: 0x01B0
class Ushake_gravGun_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/audio/misc/shake_explosion.shake_explosion_C
/// Size: 0x01B0 (432 bytes) (0x0001B0 - 0x0001B0) align 16 MaxSize: 0x01B0
class Ushake_explosion_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/audio/misc/shake_crematorDoor.shake_crematorDoor_C
/// Size: 0x01B0 (432 bytes) (0x0001B0 - 0x0001B0) align 16 MaxSize: 0x01B0
class Ushake_crematorDoor_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/audio/misc/shake_warpArrowAppear.shake_warpArrowAppear_C
/// Size: 0x01B0 (432 bytes) (0x0001B0 - 0x0001B0) align 16 MaxSize: 0x01B0
class Ushake_warpArrowAppear_C : public UMatineeCameraShake
{ 
public:
};

#pragma pack(pop)


static_assert(sizeof(Ushake_mortarFire_C) == 0x01B0); // 432 bytes (0x0001B0 - 0x0001B0)
static_assert(sizeof(Ushake_lakeEntityAttack_C) == 0x01B0); // 432 bytes (0x0001B0 - 0x0001B0)
static_assert(sizeof(Ushake_callShake_C) == 0x01B0); // 432 bytes (0x0001B0 - 0x0001B0)
static_assert(sizeof(Ushake_gravGun_C) == 0x01B0); // 432 bytes (0x0001B0 - 0x0001B0)
static_assert(sizeof(Ushake_explosion_C) == 0x01B0); // 432 bytes (0x0001B0 - 0x0001B0)
static_assert(sizeof(Ushake_crematorDoor_C) == 0x01B0); // 432 bytes (0x0001B0 - 0x0001B0)
static_assert(sizeof(Ushake_warpArrowAppear_C) == 0x01B0); // 432 bytes (0x0001B0 - 0x0001B0)
