
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: CoreUObject
/// dependency: Engine

#pragma pack(push, 0x1)

/// Class /Game/voidroom.voidroom_C
/// Size: 0x0449 (1097 bytes) (0x000220 - 0x000449) align 8 MaxSize: 0x0449
class Avoidroom_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UStaticMeshComponent*                        room1;                                                      // 0x0228   (0x0008)  
	class UPointLightComponent*                        PointLight;                                                 // 0x0230   (0x0008)  
	class UStaticMeshComponent*                        _11;                                                        // 0x0238   (0x0008)  
	class UStaticMeshComponent*                        bord11;                                                     // 0x0240   (0x0008)  
	class UStaticMeshComponent*                        bord10;                                                     // 0x0248   (0x0008)  
	class UStaticMeshComponent*                        bord9;                                                      // 0x0250   (0x0008)  
	class UStaticMeshComponent*                        bord8;                                                      // 0x0258   (0x0008)  
	class UStaticMeshComponent*                        bord7;                                                      // 0x0260   (0x0008)  
	class UStaticMeshComponent*                        bord12;                                                     // 0x0268   (0x0008)  
	class UStaticMeshComponent*                        bord6;                                                      // 0x0270   (0x0008)  
	class UStaticMeshComponent*                        bord5;                                                      // 0x0278   (0x0008)  
	class UStaticMeshComponent*                        bord4;                                                      // 0x0280   (0x0008)  
	class UStaticMeshComponent*                        bord3;                                                      // 0x0288   (0x0008)  
	class UStaticMeshComponent*                        bord2;                                                      // 0x0290   (0x0008)  
	class UStaticMeshComponent*                        bord1;                                                      // 0x0298   (0x0008)  
	class UBillboardComponent*                         borders;                                                    // 0x02A0   (0x0008)  
	class UStaticMeshComponent*                        secfloor3;                                                  // 0x02A8   (0x0008)  
	class UStaticMeshComponent*                        pillar6;                                                    // 0x02B0   (0x0008)  
	class UStaticMeshComponent*                        pillar5;                                                    // 0x02B8   (0x0008)  
	class UStaticMeshComponent*                        pillar4;                                                    // 0x02C0   (0x0008)  
	class UStaticMeshComponent*                        pillar3;                                                    // 0x02C8   (0x0008)  
	class UStaticMeshComponent*                        pillar2;                                                    // 0x02D0   (0x0008)  
	class UStaticMeshComponent*                        pillar1;                                                    // 0x02D8   (0x0008)  
	class UStaticMeshComponent*                        window3;                                                    // 0x02E0   (0x0008)  
	class UStaticMeshComponent*                        window2;                                                    // 0x02E8   (0x0008)  
	class UStaticMeshComponent*                        window1;                                                    // 0x02F0   (0x0008)  
	class UStaticMeshComponent*                        secfloor1;                                                  // 0x02F8   (0x0008)  
	class UStaticMeshComponent*                        secfloor2;                                                  // 0x0300   (0x0008)  
	class UStaticMeshComponent*                        _43;                                                        // 0x0308   (0x0008)  
	class UStaticMeshComponent*                        _42;                                                        // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        _41;                                                        // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        _40;                                                        // 0x0320   (0x0008)  
	class UStaticMeshComponent*                        _37;                                                        // 0x0328   (0x0008)  
	class UStaticMeshComponent*                        _36;                                                        // 0x0330   (0x0008)  
	class UStaticMeshComponent*                        _35;                                                        // 0x0338   (0x0008)  
	class UStaticMeshComponent*                        _34;                                                        // 0x0340   (0x0008)  
	class UStaticMeshComponent*                        _33;                                                        // 0x0348   (0x0008)  
	class UStaticMeshComponent*                        _32;                                                        // 0x0350   (0x0008)  
	class UStaticMeshComponent*                        _30;                                                        // 0x0358   (0x0008)  
	class UStaticMeshComponent*                        _28;                                                        // 0x0360   (0x0008)  
	class UStaticMeshComponent*                        _27;                                                        // 0x0368   (0x0008)  
	class UStaticMeshComponent*                        _26;                                                        // 0x0370   (0x0008)  
	class UStaticMeshComponent*                        _24;                                                        // 0x0378   (0x0008)  
	class UStaticMeshComponent*                        _23;                                                        // 0x0380   (0x0008)  
	class UStaticMeshComponent*                        _15;                                                        // 0x0388   (0x0008)  
	class UStaticMeshComponent*                        _21;                                                        // 0x0390   (0x0008)  
	class UStaticMeshComponent*                        _20;                                                        // 0x0398   (0x0008)  
	class UStaticMeshComponent*                        _19;                                                        // 0x03A0   (0x0008)  
	class UStaticMeshComponent*                        _16;                                                        // 0x03A8   (0x0008)  
	class UStaticMeshComponent*                        _13;                                                        // 0x03B0   (0x0008)  
	class UStaticMeshComponent*                        _1;                                                         // 0x03B8   (0x0008)  
	class UStaticMeshComponent*                        _10;                                                        // 0x03C0   (0x0008)  
	class UStaticMeshComponent*                        _9;                                                         // 0x03C8   (0x0008)  
	class UStaticMeshComponent*                        _8;                                                         // 0x03D0   (0x0008)  
	class UStaticMeshComponent*                        _6;                                                         // 0x03D8   (0x0008)  
	class UStaticMeshComponent*                        _5;                                                         // 0x03E0   (0x0008)  
	class UStaticMeshComponent*                        _4;                                                         // 0x03E8   (0x0008)  
	class UStaticMeshComponent*                        _3;                                                         // 0x03F0   (0x0008)  
	class UStaticMeshComponent*                        _2;                                                         // 0x03F8   (0x0008)  
	class UStaticMeshComponent*                        _12;                                                        // 0x0400   (0x0008)  
	class UBillboardComponent*                         Boxes;                                                      // 0x0408   (0x0008)  
	class UStaticMeshComponent*                        room;                                                       // 0x0410   (0x0008)  
	class UStaticMeshComponent*                        door2;                                                      // 0x0418   (0x0008)  
	class UStaticMeshComponent*                        door1;                                                      // 0x0420   (0x0008)  
	class UBillboardComponent*                         Root;                                                       // 0x0428   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0430   (0x0008)  
	TArray<FString>                                    corpseItems;                                                // 0x0438   (0x0010)  
	bool                                               spawnStuff;                                                 // 0x0448   (0x0001)  


	/// Functions
	// Function /Game/voidroom.voidroom_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1414700] Event|Protected|BlueprintEvent 
	// Function /Game/voidroom.voidroom_C.ExecuteUbergraph_voidroom
	// void ExecuteUbergraph_voidroom(int32_t EntryPoint);                                                                      // [0x1414700] Final                
};

#pragma pack(pop)


static_assert(sizeof(Avoidroom_C) == 0x0449); // 1097 bytes (0x000220 - 0x000449)
static_assert(offsetof(Avoidroom_C, UberGraphFrame) == 0x0220);
static_assert(offsetof(Avoidroom_C, room1) == 0x0228);
static_assert(offsetof(Avoidroom_C, PointLight) == 0x0230);
static_assert(offsetof(Avoidroom_C, _11) == 0x0238);
static_assert(offsetof(Avoidroom_C, bord11) == 0x0240);
static_assert(offsetof(Avoidroom_C, bord10) == 0x0248);
static_assert(offsetof(Avoidroom_C, bord9) == 0x0250);
static_assert(offsetof(Avoidroom_C, bord8) == 0x0258);
static_assert(offsetof(Avoidroom_C, bord7) == 0x0260);
static_assert(offsetof(Avoidroom_C, bord12) == 0x0268);
static_assert(offsetof(Avoidroom_C, bord6) == 0x0270);
static_assert(offsetof(Avoidroom_C, bord5) == 0x0278);
static_assert(offsetof(Avoidroom_C, bord4) == 0x0280);
static_assert(offsetof(Avoidroom_C, bord3) == 0x0288);
static_assert(offsetof(Avoidroom_C, bord2) == 0x0290);
static_assert(offsetof(Avoidroom_C, bord1) == 0x0298);
static_assert(offsetof(Avoidroom_C, borders) == 0x02A0);
static_assert(offsetof(Avoidroom_C, secfloor3) == 0x02A8);
static_assert(offsetof(Avoidroom_C, pillar6) == 0x02B0);
static_assert(offsetof(Avoidroom_C, pillar5) == 0x02B8);
static_assert(offsetof(Avoidroom_C, pillar4) == 0x02C0);
static_assert(offsetof(Avoidroom_C, pillar3) == 0x02C8);
static_assert(offsetof(Avoidroom_C, pillar2) == 0x02D0);
static_assert(offsetof(Avoidroom_C, pillar1) == 0x02D8);
static_assert(offsetof(Avoidroom_C, window3) == 0x02E0);
static_assert(offsetof(Avoidroom_C, window2) == 0x02E8);
static_assert(offsetof(Avoidroom_C, window1) == 0x02F0);
static_assert(offsetof(Avoidroom_C, secfloor1) == 0x02F8);
static_assert(offsetof(Avoidroom_C, secfloor2) == 0x0300);
static_assert(offsetof(Avoidroom_C, _43) == 0x0308);
static_assert(offsetof(Avoidroom_C, _42) == 0x0310);
static_assert(offsetof(Avoidroom_C, _41) == 0x0318);
static_assert(offsetof(Avoidroom_C, _40) == 0x0320);
static_assert(offsetof(Avoidroom_C, _37) == 0x0328);
static_assert(offsetof(Avoidroom_C, _36) == 0x0330);
static_assert(offsetof(Avoidroom_C, _35) == 0x0338);
static_assert(offsetof(Avoidroom_C, _34) == 0x0340);
static_assert(offsetof(Avoidroom_C, _33) == 0x0348);
static_assert(offsetof(Avoidroom_C, _32) == 0x0350);
static_assert(offsetof(Avoidroom_C, _30) == 0x0358);
static_assert(offsetof(Avoidroom_C, _28) == 0x0360);
static_assert(offsetof(Avoidroom_C, _27) == 0x0368);
static_assert(offsetof(Avoidroom_C, _26) == 0x0370);
static_assert(offsetof(Avoidroom_C, _24) == 0x0378);
static_assert(offsetof(Avoidroom_C, _23) == 0x0380);
static_assert(offsetof(Avoidroom_C, _15) == 0x0388);
static_assert(offsetof(Avoidroom_C, _21) == 0x0390);
static_assert(offsetof(Avoidroom_C, _20) == 0x0398);
static_assert(offsetof(Avoidroom_C, _19) == 0x03A0);
static_assert(offsetof(Avoidroom_C, _16) == 0x03A8);
static_assert(offsetof(Avoidroom_C, _13) == 0x03B0);
static_assert(offsetof(Avoidroom_C, _1) == 0x03B8);
static_assert(offsetof(Avoidroom_C, _10) == 0x03C0);
static_assert(offsetof(Avoidroom_C, _9) == 0x03C8);
static_assert(offsetof(Avoidroom_C, _8) == 0x03D0);
static_assert(offsetof(Avoidroom_C, _6) == 0x03D8);
static_assert(offsetof(Avoidroom_C, _5) == 0x03E0);
static_assert(offsetof(Avoidroom_C, _4) == 0x03E8);
static_assert(offsetof(Avoidroom_C, _3) == 0x03F0);
static_assert(offsetof(Avoidroom_C, _2) == 0x03F8);
static_assert(offsetof(Avoidroom_C, _12) == 0x0400);
static_assert(offsetof(Avoidroom_C, Boxes) == 0x0408);
static_assert(offsetof(Avoidroom_C, room) == 0x0410);
static_assert(offsetof(Avoidroom_C, door2) == 0x0418);
static_assert(offsetof(Avoidroom_C, door1) == 0x0420);
static_assert(offsetof(Avoidroom_C, Root) == 0x0428);
static_assert(offsetof(Avoidroom_C, DefaultSceneRoot) == 0x0430);
static_assert(offsetof(Avoidroom_C, corpseItems) == 0x0438);
